MikroElektronika/core_packages/PIC/XC8/def/PIC18LF46J50/mcu.h
        unsigned nA1                    :1;
    };
    struct {
        unsigned                        :2;
        unsigned NOT_WRITE1             :1;
    };
    struct {
        unsigned                        :5;
        unsigned NOT_ADDRESS1           :1;
    };
    struct {
        unsigned                        :2;
        unsigned nWRITE1                :1;
        unsigned                        :2;
        unsigned nADDRESS1              :1;
    };
    struct {
        unsigned                        :2;
        unsigned READ_WRITE1            :1;
        unsigned                        :2;
        unsigned DATA_ADDRESS1          :1;
    };
    struct {
        unsigned                        :2;
        unsigned I2C_READ1              :1;
        unsigned I2C_START1             :1;
        unsigned I2C_STOP1              :1;
        unsigned I2C_DAT1               :1;
    };
    struct {
        unsigned                        :2;
        unsigned RW                     :1;
        unsigned START                  :1;
        unsigned STOP                   :1;
        unsigned DA                     :1;
    };
    struct {
        unsigned                        :2;
        unsigned RW1                    :1;
        unsigned START1                 :1;
        unsigned STOP1                  :1;
        unsigned DA1                    :1;
    };
    struct {
        unsigned                        :2;
        unsigned NOT_W                  :1;
    };
    struct {
        unsigned                        :5;
        unsigned NOT_A                  :1;
    };
} SSPSTATbits_t;
extern volatile SSPSTATbits_t SSPSTATbits __at(0xFC7);
// bitfield macros
#define _SSPSTAT_R_NOT_W_POSN                               0x2
#define _SSPSTAT_R_NOT_W_POSITION                           0x2
#define _SSPSTAT_R_NOT_W_SIZE                               0x1
#define _SSPSTAT_R_NOT_W_LENGTH                             0x1
#define _SSPSTAT_R_NOT_W_MASK                               0x4
#define _SSPSTAT_D_NOT_A_POSN                               0x5
#define _SSPSTAT_D_NOT_A_POSITION                           0x5
#define _SSPSTAT_D_NOT_A_SIZE                               0x1
#define _SSPSTAT_D_NOT_A_LENGTH                             0x1
#define _SSPSTAT_D_NOT_A_MASK                               0x20
#define _SSPSTAT_BF_POSN                                    0x0
#define _SSPSTAT_BF_POSITION                                0x0
#define _SSPSTAT_BF_SIZE                                    0x1
#define _SSPSTAT_BF_LENGTH                                  0x1
#define _SSPSTAT_BF_MASK                                    0x1
#define _SSPSTAT_UA_POSN                                    0x1
#define _SSPSTAT_UA_POSITION                                0x1
#define _SSPSTAT_UA_SIZE                                    0x1
#define _SSPSTAT_UA_LENGTH                                  0x1
#define _SSPSTAT_UA_MASK                                    0x2
#define _SSPSTAT_R_nW_POSN                                  0x2
#define _SSPSTAT_R_nW_POSITION                              0x2
#define _SSPSTAT_R_nW_SIZE                                  0x1
#define _SSPSTAT_R_nW_LENGTH                                0x1
#define _SSPSTAT_R_nW_MASK                                  0x4
#define _SSPSTAT_S_POSN                                     0x3
#define _SSPSTAT_S_POSITION                                 0x3
#define _SSPSTAT_S_SIZE                                     0x1
#define _SSPSTAT_S_LENGTH                                   0x1
#define _SSPSTAT_S_MASK                                     0x8
#define _SSPSTAT_P_POSN                                     0x4
#define _SSPSTAT_P_POSITION                                 0x4
#define _SSPSTAT_P_SIZE                                     0x1
#define _SSPSTAT_P_LENGTH                                   0x1
#define _SSPSTAT_P_MASK                                     0x10
#define _SSPSTAT_D_nA_POSN                                  0x5
#define _SSPSTAT_D_nA_POSITION                              0x5
#define _SSPSTAT_D_nA_SIZE                                  0x1
#define _SSPSTAT_D_nA_LENGTH                                0x1
#define _SSPSTAT_D_nA_MASK                                  0x20
#define _SSPSTAT_CKE_POSN                                   0x6
#define _SSPSTAT_CKE_POSITION                               0x6
#define _SSPSTAT_CKE_SIZE                                   0x1
#define _SSPSTAT_CKE_LENGTH                                 0x1
#define _SSPSTAT_CKE_MASK                                   0x40
#define _SSPSTAT_SMP_POSN                                   0x7
#define _SSPSTAT_SMP_POSITION                               0x7
#define _SSPSTAT_SMP_SIZE                                   0x1
#define _SSPSTAT_SMP_LENGTH                                 0x1
#define _SSPSTAT_SMP_MASK                                   0x80
#define _SSPSTAT_R_POSN                                     0x2
#define _SSPSTAT_R_POSITION                                 0x2
#define _SSPSTAT_R_SIZE                                     0x1
#define _SSPSTAT_R_LENGTH                                   0x1
#define _SSPSTAT_R_MASK                                     0x4
#define _SSPSTAT_D_POSN                                     0x5
#define _SSPSTAT_D_POSITION                                 0x5
#define _SSPSTAT_D_SIZE                                     0x1
#define _SSPSTAT_D_LENGTH                                   0x1
#define _SSPSTAT_D_MASK                                     0x20
#define _SSPSTAT_R_W_POSN                                   0x2
#define _SSPSTAT_R_W_POSITION                               0x2
#define _SSPSTAT_R_W_SIZE                                   0x1
#define _SSPSTAT_R_W_LENGTH                                 0x1
#define _SSPSTAT_R_W_MASK                                   0x4
#define _SSPSTAT_D_A_POSN                                   0x5
#define _SSPSTAT_D_A_POSITION                               0x5
#define _SSPSTAT_D_A_SIZE                                   0x1
#define _SSPSTAT_D_A_LENGTH                                 0x1
#define _SSPSTAT_D_A_MASK                                   0x20
#define _SSPSTAT_nW_POSN                                    0x2
#define _SSPSTAT_nW_POSITION                                0x2
#define _SSPSTAT_nW_SIZE                                    0x1
#define _SSPSTAT_nW_LENGTH                                  0x1
#define _SSPSTAT_nW_MASK                                    0x4
#define _SSPSTAT_nA_POSN                                    0x5
#define _SSPSTAT_nA_POSITION                                0x5
#define _SSPSTAT_nA_SIZE                                    0x1
#define _SSPSTAT_nA_LENGTH                                  0x1
#define _SSPSTAT_nA_MASK                                    0x20
#define _SSPSTAT_NOT_WRITE_POSN                             0x2
#define _SSPSTAT_NOT_WRITE_POSITION                         0x2
#define _SSPSTAT_NOT_WRITE_SIZE                             0x1
#define _SSPSTAT_NOT_WRITE_LENGTH                           0x1
#define _SSPSTAT_NOT_WRITE_MASK                             0x4
#define _SSPSTAT_NOT_ADDRESS_POSN                           0x5
#define _SSPSTAT_NOT_ADDRESS_POSITION                       0x5
#define _SSPSTAT_NOT_ADDRESS_SIZE                           0x1
#define _SSPSTAT_NOT_ADDRESS_LENGTH                         0x1
#define _SSPSTAT_NOT_ADDRESS_MASK                           0x20
#define _SSPSTAT_nWRITE_POSN                                0x2
#define _SSPSTAT_nWRITE_POSITION                            0x2
#define _SSPSTAT_nWRITE_SIZE                                0x1
#define _SSPSTAT_nWRITE_LENGTH                              0x1
#define _SSPSTAT_nWRITE_MASK                                0x4
#define _SSPSTAT_nADDRESS_POSN                              0x5
#define _SSPSTAT_nADDRESS_POSITION                          0x5
#define _SSPSTAT_nADDRESS_SIZE                              0x1
#define _SSPSTAT_nADDRESS_LENGTH                            0x1
#define _SSPSTAT_nADDRESS_MASK                              0x20
#define _SSPSTAT_READ_WRITE_POSN                            0x2
#define _SSPSTAT_READ_WRITE_POSITION                        0x2
#define _SSPSTAT_READ_WRITE_SIZE                            0x1
#define _SSPSTAT_READ_WRITE_LENGTH                          0x1
#define _SSPSTAT_READ_WRITE_MASK                            0x4
#define _SSPSTAT_DATA_ADDRESS_POSN                          0x5
#define _SSPSTAT_DATA_ADDRESS_POSITION                      0x5
#define _SSPSTAT_DATA_ADDRESS_SIZE                          0x1
#define _SSPSTAT_DATA_ADDRESS_LENGTH                        0x1
#define _SSPSTAT_DATA_ADDRESS_MASK                          0x20
#define _SSPSTAT_I2C_READ_POSN                              0x2
#define _SSPSTAT_I2C_READ_POSITION                          0x2
#define _SSPSTAT_I2C_READ_SIZE                              0x1
#define _SSPSTAT_I2C_READ_LENGTH                            0x1
#define _SSPSTAT_I2C_READ_MASK                              0x4
#define _SSPSTAT_I2C_START_POSN                             0x3
#define _SSPSTAT_I2C_START_POSITION                         0x3
#define _SSPSTAT_I2C_START_SIZE                             0x1
#define _SSPSTAT_I2C_START_LENGTH                           0x1
#define _SSPSTAT_I2C_START_MASK                             0x8
#define _SSPSTAT_I2C_STOP_POSN                              0x4
#define _SSPSTAT_I2C_STOP_POSITION                          0x4
#define _SSPSTAT_I2C_STOP_SIZE                              0x1
#define _SSPSTAT_I2C_STOP_LENGTH                            0x1
#define _SSPSTAT_I2C_STOP_MASK                              0x10
#define _SSPSTAT_I2C_DAT_POSN                               0x5
#define _SSPSTAT_I2C_DAT_POSITION                           0x5
#define _SSPSTAT_I2C_DAT_SIZE                               0x1
#define _SSPSTAT_I2C_DAT_LENGTH                             0x1
#define _SSPSTAT_I2C_DAT_MASK                               0x20
#define _SSPSTAT_R_NOT_W1_POSN                              0x2
#define _SSPSTAT_R_NOT_W1_POSITION                          0x2
#define _SSPSTAT_R_NOT_W1_SIZE                              0x1
#define _SSPSTAT_R_NOT_W1_LENGTH                            0x1
#define _SSPSTAT_R_NOT_W1_MASK                              0x4
#define _SSPSTAT_D_NOT_A1_POSN                              0x5
#define _SSPSTAT_D_NOT_A1_POSITION                          0x5
#define _SSPSTAT_D_NOT_A1_SIZE                              0x1
#define _SSPSTAT_D_NOT_A1_LENGTH                            0x1
#define _SSPSTAT_D_NOT_A1_MASK                              0x20
#define _SSPSTAT_BF1_POSN                                   0x0
#define _SSPSTAT_BF1_POSITION                               0x0
#define _SSPSTAT_BF1_SIZE                                   0x1
#define _SSPSTAT_BF1_LENGTH                                 0x1
#define _SSPSTAT_BF1_MASK                                   0x1
#define _SSPSTAT_UA1_POSN                                   0x1
#define _SSPSTAT_UA1_POSITION                               0x1
#define _SSPSTAT_UA1_SIZE                                   0x1
#define _SSPSTAT_UA1_LENGTH                                 0x1
#define _SSPSTAT_UA1_MASK                                   0x2
#define _SSPSTAT_R_nW1_POSN                                 0x2
#define _SSPSTAT_R_nW1_POSITION                             0x2
#define _SSPSTAT_R_nW1_SIZE                                 0x1
#define _SSPSTAT_R_nW1_LENGTH                               0x1
#define _SSPSTAT_R_nW1_MASK                                 0x4
#define _SSPSTAT_S1_POSN                                    0x3
#define _SSPSTAT_S1_POSITION                                0x3
#define _SSPSTAT_S1_SIZE                                    0x1
#define _SSPSTAT_S1_LENGTH                                  0x1
#define _SSPSTAT_S1_MASK                                    0x8
#define _SSPSTAT_P1_POSN                                    0x4
#define _SSPSTAT_P1_POSITION                                0x4
#define _SSPSTAT_P1_SIZE                                    0x1
#define _SSPSTAT_P1_LENGTH                                  0x1
#define _SSPSTAT_P1_MASK                                    0x10
#define _SSPSTAT_D_nA1_POSN                                 0x5
#define _SSPSTAT_D_nA1_POSITION                             0x5
#define _SSPSTAT_D_nA1_SIZE                                 0x1
#define _SSPSTAT_D_nA1_LENGTH                               0x1
#define _SSPSTAT_D_nA1_MASK                                 0x20
#define _SSPSTAT_CKE1_POSN                                  0x6
#define _SSPSTAT_CKE1_POSITION                              0x6
#define _SSPSTAT_CKE1_SIZE                                  0x1
#define _SSPSTAT_CKE1_LENGTH                                0x1
#define _SSPSTAT_CKE1_MASK                                  0x40
#define _SSPSTAT_SMP1_POSN                                  0x7
#define _SSPSTAT_SMP1_POSITION                              0x7
#define _SSPSTAT_SMP1_SIZE                                  0x1
#define _SSPSTAT_SMP1_LENGTH                                0x1
#define _SSPSTAT_SMP1_MASK                                  0x80
#define _SSPSTAT_R1_POSN                                    0x2
#define _SSPSTAT_R1_POSITION                                0x2
#define _SSPSTAT_R1_SIZE                                    0x1
#define _SSPSTAT_R1_LENGTH                                  0x1
#define _SSPSTAT_R1_MASK                                    0x4
#define _SSPSTAT_D1_POSN                                    0x5
#define _SSPSTAT_D1_POSITION                                0x5
#define _SSPSTAT_D1_SIZE                                    0x1
#define _SSPSTAT_D1_LENGTH                                  0x1
#define _SSPSTAT_D1_MASK                                    0x20
#define _SSPSTAT_D_A1_POSN                                  0x2
#define _SSPSTAT_D_A1_POSITION                              0x2
#define _SSPSTAT_D_A1_SIZE                                  0x1
#define _SSPSTAT_D_A1_LENGTH                                0x1
#define _SSPSTAT_D_A1_MASK                                  0x4
#define _SSPSTAT_R_W1_POSN                                  0x5
#define _SSPSTAT_R_W1_POSITION                              0x5
#define _SSPSTAT_R_W1_SIZE                                  0x1
#define _SSPSTAT_R_W1_LENGTH                                0x1
#define _SSPSTAT_R_W1_MASK                                  0x20
#define _SSPSTAT_NOT_W1_POSN                                0x2
#define _SSPSTAT_NOT_W1_POSITION                            0x2
#define _SSPSTAT_NOT_W1_SIZE                                0x1
#define _SSPSTAT_NOT_W1_LENGTH                              0x1
#define _SSPSTAT_NOT_W1_MASK                                0x4
#define _SSPSTAT_NOT_A1_POSN                                0x5
#define _SSPSTAT_NOT_A1_POSITION                            0x5
#define _SSPSTAT_NOT_A1_SIZE                                0x1
#define _SSPSTAT_NOT_A1_LENGTH                              0x1
#define _SSPSTAT_NOT_A1_MASK                                0x20
#define _SSPSTAT_nW1_POSN                                   0x2
#define _SSPSTAT_nW1_POSITION                               0x2
#define _SSPSTAT_nW1_SIZE                                   0x1
#define _SSPSTAT_nW1_LENGTH                                 0x1
#define _SSPSTAT_nW1_MASK                                   0x4
#define _SSPSTAT_nA1_POSN                                   0x5
#define _SSPSTAT_nA1_POSITION                               0x5
#define _SSPSTAT_nA1_SIZE                                   0x1
#define _SSPSTAT_nA1_LENGTH                                 0x1
#define _SSPSTAT_nA1_MASK                                   0x20
#define _SSPSTAT_NOT_WRITE1_POSN                            0x2
#define _SSPSTAT_NOT_WRITE1_POSITION                        0x2
#define _SSPSTAT_NOT_WRITE1_SIZE                            0x1
#define _SSPSTAT_NOT_WRITE1_LENGTH                          0x1
#define _SSPSTAT_NOT_WRITE1_MASK                            0x4
#define _SSPSTAT_NOT_ADDRESS1_POSN                          0x5
#define _SSPSTAT_NOT_ADDRESS1_POSITION                      0x5
#define _SSPSTAT_NOT_ADDRESS1_SIZE                          0x1
#define _SSPSTAT_NOT_ADDRESS1_LENGTH                        0x1
#define _SSPSTAT_NOT_ADDRESS1_MASK                          0x20
#define _SSPSTAT_nWRITE1_POSN                               0x2
#define _SSPSTAT_nWRITE1_POSITION                           0x2
#define _SSPSTAT_nWRITE1_SIZE                               0x1
#define _SSPSTAT_nWRITE1_LENGTH                             0x1
#define _SSPSTAT_nWRITE1_MASK                               0x4
#define _SSPSTAT_nADDRESS1_POSN                             0x5
#define _SSPSTAT_nADDRESS1_POSITION                         0x5
#define _SSPSTAT_nADDRESS1_SIZE                             0x1
#define _SSPSTAT_nADDRESS1_LENGTH                           0x1
#define _SSPSTAT_nADDRESS1_MASK                             0x20
#define _SSPSTAT_READ_WRITE1_POSN                           0x2
#define _SSPSTAT_READ_WRITE1_POSITION                       0x2
#define _SSPSTAT_READ_WRITE1_SIZE                           0x1
#define _SSPSTAT_READ_WRITE1_LENGTH                         0x1
#define _SSPSTAT_READ_WRITE1_MASK                           0x4
#define _SSPSTAT_DATA_ADDRESS1_POSN                         0x5
#define _SSPSTAT_DATA_ADDRESS1_POSITION                     0x5
#define _SSPSTAT_DATA_ADDRESS1_SIZE                         0x1
#define _SSPSTAT_DATA_ADDRESS1_LENGTH                       0x1
#define _SSPSTAT_DATA_ADDRESS1_MASK                         0x20
#define _SSPSTAT_I2C_READ1_POSN                             0x2
#define _SSPSTAT_I2C_READ1_POSITION                         0x2
#define _SSPSTAT_I2C_READ1_SIZE                             0x1
#define _SSPSTAT_I2C_READ1_LENGTH                           0x1
#define _SSPSTAT_I2C_READ1_MASK                             0x4
#define _SSPSTAT_I2C_START1_POSN                            0x3
#define _SSPSTAT_I2C_START1_POSITION                        0x3
#define _SSPSTAT_I2C_START1_SIZE                            0x1
#define _SSPSTAT_I2C_START1_LENGTH                          0x1
#define _SSPSTAT_I2C_START1_MASK                            0x8
#define _SSPSTAT_I2C_STOP1_POSN                             0x4
#define _SSPSTAT_I2C_STOP1_POSITION                         0x4
#define _SSPSTAT_I2C_STOP1_SIZE                             0x1
#define _SSPSTAT_I2C_STOP1_LENGTH                           0x1
#define _SSPSTAT_I2C_STOP1_MASK                             0x10
#define _SSPSTAT_I2C_DAT1_POSN                              0x5
#define _SSPSTAT_I2C_DAT1_POSITION                          0x5
#define _SSPSTAT_I2C_DAT1_SIZE                              0x1
#define _SSPSTAT_I2C_DAT1_LENGTH                            0x1
#define _SSPSTAT_I2C_DAT1_MASK                              0x20
#define _SSPSTAT_RW_POSN                                    0x2
#define _SSPSTAT_RW_POSITION                                0x2
#define _SSPSTAT_RW_SIZE                                    0x1
#define _SSPSTAT_RW_LENGTH                                  0x1
#define _SSPSTAT_RW_MASK                                    0x4
#define _SSPSTAT_START_POSN                                 0x3
#define _SSPSTAT_START_POSITION                             0x3
#define _SSPSTAT_START_SIZE                                 0x1
#define _SSPSTAT_START_LENGTH                               0x1
#define _SSPSTAT_START_MASK                                 0x8
#define _SSPSTAT_STOP_POSN                                  0x4
#define _SSPSTAT_STOP_POSITION                              0x4
#define _SSPSTAT_STOP_SIZE                                  0x1
#define _SSPSTAT_STOP_LENGTH                                0x1
#define _SSPSTAT_STOP_MASK                                  0x10
#define _SSPSTAT_DA_POSN                                    0x5
#define _SSPSTAT_DA_POSITION                                0x5
#define _SSPSTAT_DA_SIZE                                    0x1
#define _SSPSTAT_DA_LENGTH                                  0x1
#define _SSPSTAT_DA_MASK                                    0x20
#define _SSPSTAT_RW1_POSN                                   0x2
#define _SSPSTAT_RW1_POSITION                               0x2
#define _SSPSTAT_RW1_SIZE                                   0x1
#define _SSPSTAT_RW1_LENGTH                                 0x1
#define _SSPSTAT_RW1_MASK                                   0x4
#define _SSPSTAT_START1_POSN                                0x3
#define _SSPSTAT_START1_POSITION                            0x3
#define _SSPSTAT_START1_SIZE                                0x1
#define _SSPSTAT_START1_LENGTH                              0x1
#define _SSPSTAT_START1_MASK                                0x8
#define _SSPSTAT_STOP1_POSN                                 0x4
#define _SSPSTAT_STOP1_POSITION                             0x4
#define _SSPSTAT_STOP1_SIZE                                 0x1
#define _SSPSTAT_STOP1_LENGTH                               0x1
#define _SSPSTAT_STOP1_MASK                                 0x10
#define _SSPSTAT_DA1_POSN                                   0x5
#define _SSPSTAT_DA1_POSITION                               0x5
#define _SSPSTAT_DA1_SIZE                                   0x1
#define _SSPSTAT_DA1_LENGTH                                 0x1
#define _SSPSTAT_DA1_MASK                                   0x20
#define _SSPSTAT_NOT_W_POSN                                 0x2
#define _SSPSTAT_NOT_W_POSITION                             0x2
#define _SSPSTAT_NOT_W_SIZE                                 0x1
#define _SSPSTAT_NOT_W_LENGTH                               0x1
#define _SSPSTAT_NOT_W_MASK                                 0x4
#define _SSPSTAT_NOT_A_POSN                                 0x5
#define _SSPSTAT_NOT_A_POSITION                             0x5
#define _SSPSTAT_NOT_A_SIZE                                 0x1
#define _SSPSTAT_NOT_A_LENGTH                               0x1
#define _SSPSTAT_NOT_A_MASK                                 0x20

// Register: SSP1ADD
#define SSP1ADD SSP1ADD
extern volatile unsigned char           SSP1ADD             __at(0xFC8);
#ifndef _LIB_BUILD
asm("SSP1ADD equ 0FC8h");
#endif
// aliases
extern volatile unsigned char           SSPADD              __at(0xFC8);
#ifndef _LIB_BUILD
asm("SSPADD equ 0FC8h");
#endif
extern volatile unsigned char           SSP1MSK             __at(0xFC8);
#ifndef _LIB_BUILD
asm("SSP1MSK equ 0FC8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSPADD                 :8;
    };
    struct {
        unsigned MSK0                   :1;
        unsigned MSK1                   :1;
        unsigned MSK2                   :1;
        unsigned MSK3                   :1;
        unsigned MSK4                   :1;
        unsigned MSK5                   :1;
        unsigned MSK6                   :1;
        unsigned MSK7                   :1;
    };
    struct {
        unsigned MSK01                  :1;
        unsigned MSK11                  :1;
        unsigned MSK21                  :1;
        unsigned MSK31                  :1;
        unsigned MSK41                  :1;
        unsigned MSK51                  :1;
        unsigned MSK61                  :1;
        unsigned MSK71                  :1;
    };
} SSP1ADDbits_t;
